# Поговорка

# Что нужно сделать:

# Мы немного сбились с последовательности, но этап технического задания (ТЗ) пропускать нельзя, у программистов есть одна забавная поговорка – “Без внятного ТЗ результат будет ХЗ”. Давайте воспользуемся этой мудростью и напишем своё техническое задание к проекту. На следующем занятии перед защитой проекта каждому будет необходимо прописать своё ТЗ и рассказать его.

# Техническое задание должно состоять из:

# Цели проекта, для чего он нужен
# Как им пользоваться, опишите какие шаги должен пройти пользователь, чтобы добиться предполагаемого результата
# Опишите инструменты, которыми вы пользовались при его написании (библиотеки, среда разработки, ЯП и др.)
# В случае, если было решено писать телеграмм-бота – опишите команды, которые у вас есть в проекте
# Опишите структуру проекта (кода).

# =========

# Подготовка

# Что нужно сделать:

# В соответствии с ТЗ доработайте свой проект, если оно того требует или какие-либо пункты ТЗ ещё не соответствуют фактическому функционалу вашего проекта.

# ==========

# Презентация

# Что нужно сделать:

# Сделайте небольшую презентацию к вашему проекту.

# Презентация должна включать:

# Краткая информация о вас
# Ваши цели в программировании
# Структура проекта
# Функционал проекта
# Можно добавить что-то ещё, однако важно будет уложиться в 5-6 минут по рассказу презентации.

# Комментарий преподавателя:
# Кнопка Clear очищает все окно, кроме кнопки Exit. Так и задумано? Если да, то я не оценил фичу.
#
# В остальном все отлично! Поздравляю с первым проектом!
# steam_proj.py  на главной стр Clear странно работает, но пофиг уже

"""
Чат-бот – это программа, которая в текстовом чате отвечает на заранее определенные команды.

Сферы использования чат-ботов:

Страхование. Чат-боты могут выполнять разные задачи, например, упрощать подачу исков, претензий, запросов и так далее.
Коммунальные услуги. У многих людей сформировалось отрицательное отношение к коммунальщикам, но роботы могут изменить положение вещей. Их можно применять для виртуальной рассылки, чтобы сообщить об аварии или других проблемах. Еще они пригодятся для подачи запроса, счета, проверки задолженностей и оформления заявки на ремонт.
Магазины. Чат-бот для Фейсбука и других соцсетей полезен тем, что он может рассказывать о новинках, акциях, обрабатывать заявки и так далее.
Медицина. Сфера, которая имеет огромный потенциал для виртуальных помощников, например, они могут предоставлять первичную консультацию, записывать на прием, вызывать врача на дом, показывать результаты анализов и так далее.
Телекоммуникации. В этой сфере наблюдается жесткая конкуренция, и чат-бот может сообщать об изменениях тарифного плана, помогать управлять счетом и использоваться для техподдержки.
Финансы. Самые распространенные сценарии применения бота такие: упрощение переводов, обмен валют, закрытие или активация карты и выполнение других дополнительных услуг.
Транспортные компании и туризм. Виртуальные помощники могут существенно упростить планирование путешествия и самой поездки. Они проводят бронь и покупку билетов, строят карту маршрута, обеспечивают онлайн регистрацию и тому подобное.
Мода и красота. Боты могут предоставить качественный и персонализированный контент, что повысит привлекательность бренда для потенциальных клиентов. Примеры сценариев использования такие: обзор последних тенденций, помощь в подборе образа, полезные советы, предоставление каталогов, резерв товара, присмотр доставки и так далее.
Рестораны. В бизнесе, связанном с общественным питанием, боты могут автоматизировать многие процессы, например, помогают сделать заказ, забронировать столик, заказать доставку и оплатить ее.
"""
