# Тест

# Что нужно сделать:
# Добавьте в тестирование подсчет правильных ответов.
# В конце выведите количество очков на экран. Пример вывод: 
# Верных ответ: 3 Добавьте условие: если игрок набирает 3 очка, 
# то выводится надпись «Ты победил», иначе «Ты проиграл», добавьте еще вопросов в тест.

# =====1===

# Повторение – мать учения
# Что нужно сделать:
# Мы начинаем писать приложение для удобного прослушивания музыки, наши песни хранятся в виде словаря. Каждая песня состоит из названия и продолжительности с точностью до долей минут.
# image_description
v_songs = {
    'World in My Eyes': 4.86,
    'Sweetest Perfection': 4.43,
    'Personal Jesus': 4.56,
    'Halo': 4.9,
    'Waiting for the Night': 6.07,
    'Enjoy the silence': 4.20 ,
    'Policy of Truth': 4.76,
    'Blue Dress': 4.29,
    'clean': 5.83,
}

# Напишите программу, которая запрашивает у пользователя количество песен из списка и названия этих песен, а на экран выводит общее время их звучания.
# Пример:
# Сколько песен выбрать? 3
# Название первой песни: Halo
# Название второй песни: Enjoy the Silence
# Название третьей песни: Clean
# Общее время звучания песен: 14,93 минуты



# Товары
# Что нужно сделать
# В базе данных магазина вся необходимая информация по товарам делится на два словаря: первый отвечает за коды товаров, второй — за списки количества разнообразных товаров на складе:
# image_description
# Каждая запись второго словаря отображает, сколько и по какой цене закупалось товаров (цена указана за одну штуку).
# Напишите программу, которая рассчитывает, на какую сумму лежит каждого товара на складе, и выводит эту информацию на экран.
# Результат работы программы:
# Лампа — 27 штук, стоимость 1134 рубля
# Стол — 54 штуки, стоимость 27 860 рублей
# Диван — 3 штуки, стоимость 3550 рублей
# Стул — 105 штук, стоимость 10 311 рублей