# Сумма
# Что нужно сделать:
# Напишите функцию summa_n, которая принимает одно целое положительное число N и выводит сумму всех чисел от 1 до N включительно.
# Пример работы программы:
# Введите число: 5
# Я знаю, что сумма чисел от 1 до 5 равна 15


# Робот
# Что нужно сделать:
# В одном отеле для эксперимента на вход хотят поставить робота, который будет спрашивать у прохожих, не желают ли они зайти. При ответе «Да» робот должен приветствовать человека и пустить в отель. Для робота написали вот такую программу с использованием функции:
"""У всех одна и та же ошибка!
Сразу вызываешь функцию приветствия, в которой находится вся логика. В функции приветствия должно быть только приветствие:
print('Привет!')
print('Добро пожаловать!')
А вызывается она только при положительном ответе на вопрос "Зайдете?"
Задача проще, чем кажется. Там только синтаксические ошибки."""
"""
Def greeting()

    print('Привет!')

    print('Добро пожаловать!')

    for i in range(5):

        a = input('Зайдёте? Да/Нет: ')

        if a = 'Да':

         greeting

    print('Следующий.\n')
    """

# Однако программист очень торопился и допустил несколько ошибок.
# Скопируйте программу в редактор кода, найдите и исправьте ошибки. Убедитесь, что программа работает корректно.
# Пример результата:

# Зайдёте? Да/Нет: Да

# Привет!

# Добро пожаловать!

# Следующий.


# Калькулятор 2
# Что нужно сделать:
# Допишите калькулятор, добавьте функции умножения и деления. 
# Все ответы должны сохраняться в текстовый документ. 
# Оберните код калькулятора в функцию. 
# Которая принимает три аргумента: два числа и операция.

